In [1]:
#05_panda_00_20180808.ipynb
#10 MINUTES TO PANDAS

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
#1. Object Creation

In [4]:
#Creating a Series by passing a list of values, 
#letting pandas create a default integer index:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
#Creating a DataFrame by passing a numpy array, 
#with a datetime index and labeled columns:

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451 -0.951501 -0.290802
2013-01-05 -0.843926 -0.482540  0.373156  1.030585
2013-01-06 -0.171144  1.854974  0.791595 -1.595398

In [11]:
#Creating a DataFrame by passing a dict of objects that 
#can be converted to series-like.

In [12]:
df2 = pd.DataFrame({ 'A' : 1.,
     'B' : pd.Timestamp('20130102'),
     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
     'D' : np.array([3] * 4,dtype='int32'),
     'E' : pd.Categorical(["test","train","test","train"]),
     'F' : 'foo' })

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
#tab completion
df2.<TAB>

In [14]:
#2. Viewing Data

In [15]:
#See the top & bottom rows of the frame

In [16]:
df.head()

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451 -0.951501 -0.290802
2013-01-05 -0.843926 -0.482540  0.373156  1.030585

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.002584  2.208451 -0.951501 -0.290802
2013-01-05 -0.843926 -0.482540  0.373156  1.030585
2013-01-06 -0.171144  1.854974  0.791595 -1.595398

In [18]:
#Display the index, columns, and the underlying numpy data

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 1.18334192, -2.50554974, -1.44338503,  0.03651411],
       [-0.47407719, -0.57074386, -0.08583359, -0.95728229],
       [ 0.44140086,  0.67508016,  0.69930219,  0.18097774],
       [ 1.0025839 ,  2.20845105, -0.95150149, -0.29080237],
       [-0.84392597, -0.48254023,  0.37315646,  1.03058538],
       [-0.17114426,  1.85497392,  0.79159481, -1.59539776]])

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.189697  0.196612 -0.102778 -0.265901
std    0.818615  1.753759  0.915161  0.918501
min   -0.843926 -2.505550 -1.443385 -1.595398
25%   -0.398344 -0.548693 -0.735085 -0.790662
50%    0.135128  0.096270  0.143661 -0.127144
75%    0.862288  1.560000  0.617766  0.144862
max    1.183342  2.208451  0.791595  1.030585

In [23]:
#Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.183342   -0.474077    0.441401    1.002584   -0.843926   -0.171144
B   -2.505550   -0.570744    0.675080    2.208451   -0.482540    1.854974
C   -1.443385   -0.085834    0.699302   -0.951501    0.373156    0.791595
D    0.036514   -0.957282    0.180978   -0.290802    1.030585   -1.595398

In [24]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.036514 -1.443385 -2.505550  1.183342
2013-01-02 -0.957282 -0.085834 -0.570744 -0.474077
2013-01-03  0.180978  0.699302  0.675080  0.441401
2013-01-04 -0.290802 -0.951501  2.208451  1.002584
2013-01-05  1.030585  0.373156 -0.482540 -0.843926
2013-01-06 -1.595398  0.791595  1.854974 -0.171144

In [25]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-05 -0.843926 -0.482540  0.373156  1.030585
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-06 -0.171144  1.854974  0.791595 -1.595398
2013-01-04  1.002584  2.208451 -0.951501 -0.290802

In [26]:
#3. Selection

In [27]:
#pandas data access methods, .at, .iat, .loc,.iloc and .ix.

In [28]:
#3.1 Getting

In [29]:
#Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01    1.183342
2013-01-02   -0.474077
2013-01-03    0.441401
2013-01-04    1.002584
2013-01-05   -0.843926
2013-01-06   -0.171144
Freq: D, Name: A, dtype: float64

In [30]:
#Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978

In [31]:
#3.2 Selection by Label

In [32]:
#For getting a cross section using a label
df.loc[dates[0]]

A    1.183342
B   -2.505550
C   -1.443385
D    0.036514
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.183342 -2.505550
2013-01-02 -0.474077 -0.570744
2013-01-03  0.441401  0.675080
2013-01-04  1.002584  2.208451
2013-01-05 -0.843926 -0.482540
2013-01-06 -0.171144  1.854974

In [34]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.474077 -0.570744
2013-01-03  0.441401  0.675080
2013-01-04  1.002584  2.208451

In [35]:
#Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A   -0.474077
B   -0.570744
Name: 2013-01-02 00:00:00, dtype: float64

In [36]:
#getting a scalar value
df.loc[dates[0],'A']

1.1833419192503392

In [37]:
#3.3 Selection by Position

In [38]:
#Select via the position of the passed integers
df.iloc[3]

A    1.002584
B    2.208451
C   -0.951501
D   -0.290802
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
#By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.002584  2.208451
2013-01-05 -0.843926 -0.482540

In [40]:
#By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.474077 -0.085834
2013-01-03  0.441401  0.699302
2013-01-05 -0.843926  0.373156

In [41]:
#For slicing rows explicitly
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978

In [42]:
#For slicing columns explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01 -2.505550 -1.443385
2013-01-02 -0.570744 -0.085834
2013-01-03  0.675080  0.699302
2013-01-04  2.208451 -0.951501
2013-01-05 -0.482540  0.373156
2013-01-06  1.854974  0.791595

In [43]:
#For getting a value explicitly
df.iloc[1,1]

-0.5707438648770025

In [47]:
#3.4 Boolean Indexing
df

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451 -0.951501 -0.290802
2013-01-05 -0.843926 -0.482540  0.373156  1.030585
2013-01-06 -0.171144  1.854974  0.791595 -1.595398

In [46]:
#Using a single columns values to select data.
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451 -0.951501 -0.290802

In [48]:
#Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  1.183342       NaN       NaN  0.036514
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451       NaN       NaN
2013-01-05       NaN       NaN  0.373156  1.030585
2013-01-06       NaN  1.854974  0.791595       NaN

In [49]:
#Using the isin() method for filtering
df2=df.copy()

In [50]:
#df2 , column 'E'
df2['E'] = ['one', 'one','two','three','four','three']

In [51]:
df2

                   A         B         C         D      E
2013-01-01  1.183342 -2.505550 -1.443385  0.036514    one
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282    one
2013-01-03  0.441401  0.675080  0.699302  0.180978    two
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  three
2013-01-05 -0.843926 -0.482540  0.373156  1.030585   four
2013-01-06 -0.171144  1.854974  0.791595 -1.595398  three

In [52]:
df2[df2['E'].isin(['three','four'])]

                   A         B         C         D      E
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  three
2013-01-05 -0.843926 -0.482540  0.373156  1.030585   four
2013-01-06 -0.171144  1.854974  0.791595 -1.595398  three

In [53]:
#5. Setting

In [54]:
df

                   A         B         C         D
2013-01-01  1.183342 -2.505550 -1.443385  0.036514
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282
2013-01-03  0.441401  0.675080  0.699302  0.180978
2013-01-04  1.002584  2.208451 -0.951501 -0.290802
2013-01-05 -0.843926 -0.482540  0.373156  1.030585
2013-01-06 -0.171144  1.854974  0.791595 -1.595398

In [55]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [56]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [57]:
# 'F' column
df['F']=s1

In [58]:
df #! 'F'  2013-01-02

                   A         B         C         D    F
2013-01-01  1.183342 -2.505550 -1.443385  0.036514  NaN
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282  1.0
2013-01-03  0.441401  0.675080  0.699302  0.180978  2.0
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  3.0
2013-01-05 -0.843926 -0.482540  0.373156  1.030585  4.0
2013-01-06 -0.171144  1.854974  0.791595 -1.595398  5.0

In [59]:
#A where operation with setting.

In [60]:
df2 = df.copy()

In [61]:
df2

                   A         B         C         D    F
2013-01-01  1.183342 -2.505550 -1.443385  0.036514  NaN
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282  1.0
2013-01-03  0.441401  0.675080  0.699302  0.180978  2.0
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  3.0
2013-01-05 -0.843926 -0.482540  0.373156  1.030585  4.0
2013-01-06 -0.171144  1.854974  0.791595 -1.595398  5.0

In [62]:
df2[df2 < 0]=0

In [67]:
df2

                   A         B         C         D    F
2013-01-01  1.183342  0.000000  0.000000  0.036514  NaN
2013-01-02  0.000000  0.000000  0.000000  0.000000  1.0
2013-01-03  0.441401  0.675080  0.699302  0.180978  2.0
2013-01-04  1.002584  2.208451  0.000000  0.000000  3.0
2013-01-05  0.000000  0.000000  0.373156  1.030585  4.0
2013-01-06  0.000000  1.854974  0.791595  0.000000  5.0

In [68]:
#5. Missing Data

In [69]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [70]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [71]:
df1

                   A         B         C         D    F    E
2013-01-01  1.183342 -2.505550 -1.443385  0.036514  NaN  1.0
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282  1.0  1.0
2013-01-03  0.441401  0.675080  0.699302  0.180978  2.0  NaN
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  3.0  NaN

In [72]:
#To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C         D    F    E
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282  1.0  1.0

In [73]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C         D    F    E
2013-01-01  1.183342 -2.505550 -1.443385  0.036514  5.0  1.0
2013-01-02 -0.474077 -0.570744 -0.085834 -0.957282  1.0  1.0
2013-01-03  0.441401  0.675080  0.699302  0.180978  2.0  5.0
2013-01-04  1.002584  2.208451 -0.951501 -0.290802  3.0  5.0

In [74]:
#To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [75]:
#Apply

In [77]:
#Applying functions to the DataFrame
df5=pd.DataFrame(np.arange(1,10).reshape(3,3),index=dates[0:3], columns=list('ABC'))

In [78]:
df5

            A  B  C
2013-01-01  1  2  3
2013-01-02  4  5  6
2013-01-03  7  8  9

In [81]:
df5.apply(np.cumsum)

             A   B   C
2013-01-01   1   2   3
2013-01-02   5   7   9
2013-01-03  12  15  18

In [83]:
df5.T.apply(np.cumsum).T

            A   B   C
2013-01-01  1   3   6
2013-01-02  4   9  15
2013-01-03  7  15  24

In [84]:
df5.apply(lambda x:-x)

            A  B  C
2013-01-01 -1 -2 -3
2013-01-02 -4 -5 -6
2013-01-03 -7 -8 -9

In [85]:
#Append

In [86]:
#Append rows to a dataframe.

In [89]:
s5=df5.loc['2013-01-03']*2

In [90]:
s5

A    14
B    16
C    18
Name: 2013-01-03 00:00:00, dtype: int32

In [91]:
df5.append(s5,ignore_index=True)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  14  16  18

In [92]:
#Reshaping